app/controllers/blogs_controller.rb

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
---
  def show
    @blog = Blog.find(params[:id])

INSERT INTO "blogs" ("created_at", "title", "updated_at") VALUES('2009-10-29 04:12:03', 'Bigs Blog', '2009-10-29 04:12:03')
---
  def create
    @blog = Blog.new(params[:blog])
    if @blog.save

SELECT * FROM "blogs" WHERE ("blogs"."id" = 3)
---
  def edit
    @blog = Blog.find(params[:id])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 4)
UPDATE "blogs" SET "updated_at" = '2009-10-29 04:23:36', "created_at" = '2009-10-29 04:23:26', "title" = 'Kicker''s Blog' WHERE "id" = 4
---
  def update
    @blog = Blog.find(params[:id])
    if @blog.update_attributes(params[:blog])