app/controllers/discussions_controller.rb

SELECT * FROM "discussions" WHERE ("discussions"."id" = 1)
---
  def show
    @discussion = Discussion.find(params[:id])

INSERT INTO "discussions" ("created_at", "title", "body", "updated_at", "user_id") VALUES('2009-12-09 04:48:45', 'My first Discussion', 'This should be a great thing if it all works correctly.', '2009-12-09 04:48:45', 7)
---
  def create
    @discussion = Discussion.new(params[:discussion])
    if @discussion.save

SELECT * FROM "discussions" WHERE ("discussions"."id" = 3)
---
  def edit
    @discussion = Discussion.find(params[:id])

SELECT * FROM "discussions" WHERE ("discussions"."id" = 3)
UPDATE "discussions" SET "updated_at" = '2010-03-26 04:47:29', "created_at" = '2010-03-26 04:44:47', "title" = 'I like to talk about my feelings', "user_id" = 7, "body" = 'Is it strange to talk about your feelings?' WHERE "id" = 3
---
  def update
    @discussion = Discussion.find(params[:id])
    if @discussion.update_attributes(params[:discussion])