app/controllers/documents_controller.rb

SELECT * FROM "documents" WHERE ("documents"."id" = 1)
---
  def show
    @document = Document.find(params[:id])

INSERT INTO "documents" ("created_at", "title", "updated_at", "user_id", "content") VALUES('2009-12-15 05:19:55', 'This is a great Document', '2009-12-15 05:19:55', 7, 'No authorization setup yet')
---
  def create
    @document = Document.new(params[:document])
    if @document.save

SELECT * FROM "documents" WHERE ("documents"."id" = 4)
---
  def edit
    @document = Document.find(params[:id])

SELECT * FROM "documents" WHERE ("documents"."id" = 4)
UPDATE "documents" SET "updated_at" = '2010-03-26 04:50:21', "created_at" = '2010-03-26 04:49:43', "title" = 'All Users must use tags', "content" = 'I have made tagging a required thing. This is to help people to categorize their thoughts.', "user_id" = 7 WHERE "id" = 4
---
  def update
    @document = Document.find(params[:id])
    if @document.update_attributes(params[:document])

SELECT * FROM "documents" WHERE ("documents"."id" = 2)
DELETE FROM "documents" WHERE "id" = 2
---
  def destroy
    @document = Document.find(params[:id])
    @document.destroy