app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "body", "updated_at", "blog_id", "user_id") VALUES('2009-11-15 05:57:44', 'My favorite things', 'This will be a great post.', '2009-11-15 05:57:44', 3, 7)
---
  def create
    @post = Post.new(params[:post])
    if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 8)
UPDATE "posts" SET "updated_at" = '2010-03-26 05:09:26', "created_at" = '2010-03-26 04:36:38', "blog_id" = 3, "title" = 'Testing out tags', "user_id" = 7, "body" = 'Does this tag list get set?' WHERE "id" = 8
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])