app/controllers/replies_controller.rb

SELECT * FROM "replies" WHERE ("replies"."id" = 298486374)
---
  def show
    @reply = Reply.find(params[:id])

SELECT * FROM "replies" WHERE ("replies"."id" = 298486374)
---
  def edit
    @reply = Reply.find(params[:id])