app/controllers/select_blog_controller.rb

  def update
		@blog = Blog.find(params[:blog])
---
SELECT * FROM "blogs" WHERE ("blogs"."id" = 3)