app/controllers/users_controller.rb

  def create
		@user = User.new(params[:user])
		if @user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('HE1wpY89X1overFddQu7', '2009-10-14 07:07:16', '2009-10-14 07:07:16', '566712c889b2a54405cf345d4d4a8c58fe4e4e908e28c8a83a05b8b7414a3f91697a7d31d6f3406b85930417ba57f4ac7c4976d3101ef7db4a4b324d18754c87', '52QKNbxbkjs4kCVp9Y5u', '2009-10-14 07:07:16', 0, '127.0.0.1', 'pq9-EvukUR3jkONiOJd-', '2009-10-14 07:07:15', 'b126825e227f7257cb4b59214909636ba807f8eaa710cdd4d1d95e594b0687f18d682be3b6e8fdf6e60ec9b3e6ba1efcb8fd7c79722728c46d9d66ce4605d3ae', 1, NULL, NULL, 'blbigelow@gmail.com')

	def destroy
		user_to_remove = User.find(params[:id])
		user_to_remove.has_no_role! :owner, user_to_remove
		User.destroy(user_to_remove)
---
SELECT * FROM "users" WHERE ("users"."id" = '7') LIMIT 1
DELETE FROM "users" WHERE "id" = 6

	def load_user
		@user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1